routes/web.php

select * from `listings` limit 15 offset 0
select count(*) as aggregate from `listings`
---
        });
});

Route::middleware([
    \Shipu\WebInstaller\Middleware\RedirectIfNotInstalled::class,
    \Torann\Currency\Middleware\CurrencyMiddleware::class,
    'language'
])->group(function () {
    Route::controller(HomeController::class)
        ->group(function () {
            Route::get('/', 'home')->name('home');
            Route::get('/' . config('listing.path_favorites', 'favorites'), 'favorites')->name('favorites');
            Route::get('/' . config('listing.path_compares', 'compares'), 'compares')->name('compares');
            Route::post('/newsletter/add', 'newsletterAdd')->name('newsletter.add');
            Route::post('/contact/submit', 'contactSubmit')->name('contact.submit');
            Route::post('/consult/submit', 'consultSubmit')->name('consult.submit');
        });

    Route::controller(BlogController::class)
        ->prefix(config('listing.path_blog'))
        ->group(function () {
            Route::get('/', 'index')->name('blog.index');
            Route::get('/{post}', 'show')->name('blog.show');
        });

    Route::controller(PageController::class)
        ->prefix(config('listing.path_page'))
        ->group(function () {