app/View/Components/SidebarListing.php

    public function render(): View|Closure|string
    {
        return view('components.sidebar-listing', [
            'condition' => Condition::select('id', 'name')->get(),
            'types' => Type::select('id', 'name')->get(),
            'makes' => Make::select('id', 'name')->has('listings')->get(),
            'drives' => DriveType::select('id', 'name')->get(),
            'fuels' => FuelType::select('id', 'name')->get(),
            'transmissions' => Transmission::select('id', 'name')->get(),
            'colors' => Color::select('id', 'name')->get(),
            'sellers' => ListedBy::select('id', 'name')->get(),
            'models' => request()->query('make') ? MakeModel::where('make_id', request()->query('make'))->get() : [],
            'features' => Feature::select('id', 'name')->get()->mapWithKeys(fn ($f) => [$f->id => $f->name])
---
select `id`, `name` from `types`
select `id`, `name` from `makes` where exists (select * from `listings` where `makes`.`id` = `listings`.`make_id`)
select `id`, `name` from `drive_types`
select `id`, `name` from `fuel_types`
select `id`, `name` from `transmissions`
select `id`, `name` from `colors`
select `id`, `name` from `listed_bies`
select `id`, `name` from `features`