app/Helpers/helpers.php

select * from `navigations` where `handle` = 'footer_menu_1' limit 1
---
    function menuTitle($menu)
    {
        $key = 'menu.key.' . $menu . '.name';

        $titleMenu = \RyanChandler\FilamentNavigation\Models\Navigation::where('handle', $menu)->first();

select * from `general_settings` limit 1
---
    function gs($key = '')
    {
        if(!appInstalled())
        {
            return null;
        }

        $gs = DB::table('general_settings')->first();