app/Filament/Widgets/DashboardOverview.php

    protected function getStats(): array
    {
        return [
            Stat::make(__('Users'), \App\Models\User::count()),
            Stat::make(__('Listing'), \App\Models\Listing::count()),
            Stat::make(__('Pages'), \App\Models\Page::count()),
            Stat::make(__('Posts'), \App\Models\Post::count()),
            Stat::make(__('Conditions'), \App\Models\Condition::count()),
            Stat::make(__('Types'), \App\Models\Type::count()),
            Stat::make(__('Makes'), \App\Models\Make::count()),
            Stat::make(__('Models'), \App\Models\MakeModel::count()),
            Stat::make(__('OfferTypes'), \App\Models\OfferType::count()),
            Stat::make(__('DriveTypes'), \App\Models\DriveType::count()),
            Stat::make(__('Transmissions'), \App\Models\Transmission::count()),
            Stat::make(__('Fuel'), \App\Models\FuelType::count()),
            Stat::make(__('Engines'), \App\Models\Engine::count()),
            Stat::make(__('Colors'), \App\Models\Engine::count()),
            Stat::make(__('Features'), \App\Models\Feature::count()),
            Stat::make(__('ListedBy'), \App\Models\ListedBy::count()),
        ];
---
select count(*) as aggregate from `users`
select count(*) as aggregate from `listings`
select count(*) as aggregate from `pages`
select count(*) as aggregate from `posts`
select count(*) as aggregate from `conditions`
select count(*) as aggregate from `types`
select count(*) as aggregate from `makes`
select count(*) as aggregate from `make_models`
select count(*) as aggregate from `offer_types`
select count(*) as aggregate from `drive_types`
select count(*) as aggregate from `transmissions`
select count(*) as aggregate from `fuel_types`
select count(*) as aggregate from `engines`
select count(*) as aggregate from `features`
select count(*) as aggregate from `listed_bies`