app/Http/Controllers/BlogController.php

select `name`, `id` from `categories`
select `name`, `id` from `tags`
---
    public function index()
    {

        $titlePage = request()->query('q') == '' ?  __('Blog') : __('Result for ":q"', ['q' => request()->query('q')]);

        $featuredPost = $this->posts->featuredPost();

        $features = $this->posts->getFeatureds($featuredPost->id);

        $posts = $this->posts->getPaginated($featuredPost, $features);

        $categories = Category::select('name', 'id')->get()->mapWithKeys(fn ($cat) => [$cat->id => $cat->name]);

        $tags = Tag::select('name', 'id')->get()->mapWithKeys(fn ($tag) => [$tag->id => $tag->name]);