app/Http/Controllers/HomeController.php

    public function home()
    {
        $page = Page::where('slug', config('listing.slug_home'))->first();
---
select * from `pages` where `slug` = 'home' limit 1

    public function compares()
    {
        $features = Feature::all();
---
select * from `features`