app/Filament/Resources/ListingResource.php

                                        ->rules(['alpha_dash'])
                                        ->disabled(!auth()->user()->sparkPlan()?->options['can_change_slug'] ?? true),
                                ]),
                            Forms\Components\Grid::make(2)
                            ->schema([
                                Forms\Components\Radio::make('listedby_id')
                                    ->label(__('Listed By'))
                                    ->options(\App\Models\ListedBy::select('name', 'id')->get()->mapWithKeys(fn ($listed) => [$listed->id => $listed->name]))
                                    ->descriptions(\App\Models\ListedBy::select('description', 'id')->get()->mapWithKeys(fn ($listed) => [$listed->id => $listed->description]))
                                    ->required(),
                                Forms\Components\Radio::make('group_id')
                                    ->label(__('Group'))
                                    ->inline()
                                    ->inlineLabel(false)
                                    ->options(\App\Models\Group::select('name', 'id')->active()->get()->mapWithKeys(fn ($group) => [$group->id => $group->name]))
                                    ->required()
                            ]),
---
select `description`, `id` from `listed_bies`

                                ->disabled(!auth()->user()->canFeatureListing() || auth()->user()->isSuperAdmin())
                                ->columnSpanFull()
                        ]),
                    Forms\Components\Wizard\Step::make(__('General data'))
                        ->schema([
                            Forms\Components\Grid::make(2)
                                ->schema([
                                    Forms\Components\Select::make('make_id')
                                        ->label(__('Make'))
                                        ->live()
                                        ->searchable()
                                        ->relationship(name: 'make', titleAttribute: 'name')
                                        ->required(),
                                    Forms\Components\Select::make('makemodel_id')
                                        ->label(__('Model'))
                                        ->options(fn (Get $get): array => \App\Models\MakeModel::select('name', 'id')->where('make_id', $get('make_id'))->get()->mapWithKeys(fn ($model) => [$model->id => $model->name])->toArray())
                                        ->disabled(fn (Get $get) => $get('make_id') == null)
                                        ->required(),
                                ]),
                            Forms\Components\Grid::make(2)
                                ->schema([
                                    Forms\Components\Select::make('type_id')
                                        ->label(__('Type'))
                                        ->relationship(name: 'type', titleAttribute: 'name')
                                        ->required(),
                                    Forms\Components\Select::make('condition_id')
                                        ->label(__('Condition'))
                                        ->relationship(name: 'condition', titleAttribute: 'name')
---
select `name`, `id` from `make_models` where `make_id` = 54