app/Repositories/Listing.php

select * from `users` where `users`.`id` in (1)
---
    public function getFavorites($limit = 6)
    {
        return auth()->user()?->favoritedListings()->paginate($limit) ?? [];

select * from `users` where `users`.`id` in (1)
---
    public function getCompares()
    {
        return auth()->user()?->comparedListings()->limit(3)->get() ?? [];

select * from `make_models` where `make_models`.`id` in (21, 373, 620, 679, 770, 1262, 1417)
select * from `makes` where `makes`.`id` in (2, 24, 26, 31, 47, 54, 65)
select * from `users` where `users`.`id` in (1)
---
    public function getRelated($id, $limit = 6)
    {
        $listing  = $this->findById($id);

        return $this->listingWithResourcers()
            ->where('id', '!=', $listing->id)
            ->where(function ($query) use ($listing) {
                $query->where('user_id', $listing->user_id)
                    ->OrWhere('make_id', $listing->make_id)
                    ->OrWhere('makemodel_id', $listing->makemodel_id);
            })
            ->sorting()
            ->paginate($limit);

select * from `listings` where `id` = 50 limit 1
---
    public function findById($id)
    {
        return $this->listingWithResourcers()
            ->whereId($id)
            ->first();

select * from `colors` where `colors`.`id` in (15)
select * from `conditions` where `conditions`.`id` in (6)
select * from `currencies` where `currencies`.`id` in (1)
select * from `drive_types` where `drive_types`.`id` in (8)
---
    public function listingWithResourcers()
    {
        return ModelsListing::with(['user', 'make', 'makemodel', 'features', 'condition', 'drivetype', 'type', 'transmission', 'fueltype', 'engine', 'exteriorcolor', 'interiorcolor', 'offertype', 'listedby', 'currency']);