app/Repositories/Listing.php

    public function getCompares()
    {
        return auth()->user()?->comparedListings()->limit(3)->paginate() ?? [];
---
select * from `users` where `users`.`id` in (1)

    public function getRelated($id, $limit = 6)
    {
        $listing  = $this->findById($id);

        return $this->listingWithResourcers()
            ->where('id', '!=', $listing->id)
            ->where(function ($query) use ($listing) {
                $query->where('user_id', $listing->user_id)
                    ->OrWhere('make_id', $listing->make_id)
                    ->OrWhere('makemodel_id', $listing->makemodel_id);
            })
            ->sorting()
            ->paginate($limit);
---
select * from `make_models` where `make_models`.`id` in (111, 156, 175, 617, 1120, 1415)
select * from `makes` where `makes`.`id` in (6, 7, 9, 24, 46, 65)
select * from `users` where `users`.`id` in (2)

    public function findById($id)
    {
        $listing = $this->listingWithResourcers()
            ->whereId($id)
            ->first();
---
select * from `listings` where `id` = 8 limit 1