app/Repositories/Pages.php

    public function findById($id)
    {
        return Page::where('id', $id)
            ->with('user')
            ->first();
---
select * from `pages` where `id` = 2 limit 1