app/Repositories/Posts.php

select * from `posts` where `is_featured` = 1 order by `created_at` desc limit 1
---
    public function featuredPost()
    {
        return Post::where('is_featured', 1)
            ->with('category', 'user', 'tags')
            ->latest()
            ->first();